[
	{
		"id": 12,
		"title": "Mist",
		"description": "Mist (macOS Installer Super Tool) on rakendus, mis võimaldab alla laadida macOS-i installereid (.app, .dmg, .iso, .pkg) ja püsivara faile (.ipsw). Toetab nii Apple Silicon kui ka Intel seadmeid. Saab valida erinevate versioonide (sh dev- ja beetaversioonide) vahel.",
		"link": "https://github.com/ninxsoft/Mist",
		"type": "äpp",
		"year": "Tööriistad",
		"motivation": "Tasuta macOS-i tööriist, mis võimaldab alla laadida erinevaid macOS-i installereid ja püsivara nii Apple Silicon kui ka Intel Macidele.",
		"logoImage": "/assets/images/projects/mist.png"
	},
	{
	  "id": 1,
	  "title": "refiner",
	  "description": "refiner on tehnikutele mõeldud macOS-i tööriist, mis võimaldab luua ehtsad Mac seadmete seerianumbreid. See on lahendus tehnikutele, kes vajavad seerianumbreid oma tööprotsessides.",
	  "link": "/staff/refiner",
	  "type": "äpp",
	  "year": "Kodukootud",
	  "motivation": "refiner on macOS-i rakendus, mis võimaldab kiiresti genereerida kehtiva formaadiga Mac seadmete seerianumbreid.",
	  "logoImage": "/assets/images/projects/refiner.png"
	},
	{
	  "id": 2,
	  "title": "DFU Blaster",
	  "description": "DFU Blaster on tööriist, mis lihtsustab Apple Silicon ja Intel arvutite viimist DFU režiimi. Traditsiooniliselt nõuab DFU režiimi viimine keerulisi klahvikombinatsioone ja täpset ajastust, kuid DFU Blaster võimaldab seda teha ühe nupuvajutusega. Toimib ainult Apple Silicon tööarvutitega.",
	  "link": "https://twocanoes.com/products/mac/dfu-blaster/",
	  "type": "äpp",
	  "year": "Tööriistad",
	  "motivation": "DFU Blaster on tööriist, mis võimaldab Apple Silicon ja Intel seadmed nupuvajutusega DFU režiimi viia.",
	  "logoImage": "/assets/images/projects/dfublaster.png"
	},
	{
		"id": 10,
		"title": "FlexBV",
		"description": "FlexBV peamine tugevus seisneb PCB paigutuste ja skeemide PDF-ide sujuvas kuvamises, võimaldades klõpsata komponendil boardview's ja koheselt leida selle vastav skeem. Leian, et see on ka tehnikutele kasulik, et anda elektroonikutele täpsem info veast.",
		"link": "https://pldaniels.com/flexbv5/",
		"type": "äpp",
		"year": "Tööriistad",
		"motivation": "FlexBV emaplaatide paigutuse ja skeemide vaatamise tarkvara, mis on mõeldud eelkõige elektroonikutele.",
		"logoImage": "/assets/images/projects/flexbv.png"
	},
	{
		"id": 3,
		"title": "Mactracker",
		"description": "Mactracker on rakendus, mis pakub teavet kõikide Apple'i seadmete kohta, sealhulgas Maci, iPhone'i, iPadi ja muude seadmete kohta. Sealt saab tehnilisi andmeid, APN-e, spetsifikatsioone ja ajaloolist teavet Apple'i seadmete kohta.",
		"link": "https://mactracker.ca",
		"type": "äpp",
		"year": "Informaatiline",
		"motivation": "Mactracker on everymac steroididel, mis pakub põhjalikku teavet kõigi Apple'i toodete kohta.",
		"logoImage": "/assets/images/projects/mactracker.png"
	},
	{
		"id": 11,
		"title": "Triloboot",
		"description": "Bootitav USB-pulk, mis sisaldab kolme peamist süsteemi: testimiseks mõeldud Debianipõhine kohandatud operatsioonisüsteem, Smart tööriist ning Aikeni keskkond, mis võimaldab seadmeid testida. Kõik komponendid on GRUB-menüüs kiiresti ligipääsetavad.",
		"link": "https://github.com/sookask/triloboot",
		"type": "USB pulk",
		"year": "Kodukootud",
		"motivation": "GRUB põhine USB bootloader, mis võimaldab bootida ühe pulga pealt testOS-i, Smarti ja ja Aikenit",
		"logoImage": "/assets/images/projects/triloboot.png"
	},
	{
		"id": 5,
		"title": "MDR",
		"description": "Bootitav USB-pulk, mis otsib SMBIOS-ist riistvara infot ja muudab kellaaja ja kuupäeva õigeks. See on mõeldud eelkõige Lenovo seadmete jaoks, millel on vale kellaaeg ja kuupäev pärast riistvara info muudatusi.",
		"link": "https://github.com/alessiorubicini/LocationPickerForSwiftUI",
		"type": "USB pulk",
		"year": "Kodukootud",
		"motivation": "MDR on mõeldud eelkõige Lenovo seadmete jaoks, millel on vale kellaaeg ja kuupäev pärast riistvara info muudatusi.",
		"logoImage": "/assets/images/projects/mdr.png"
	},
	{
		"id": 4,
		"title": "balenaEtcher",
		"description": "balenaEtcher (tuntud ka kui Etcher) on tööriist, mis on loodud operatsioonisüsteemide (.iso, .img, .zip) kirjutamiseks kõvaketastele ja USB-mälupulkadele. See on saadaval Windowsi, macOS-i ja Linuxi süsteemidele.",
		"link": "https://etcher.balena.io",
		"type": "äpp",
		"year": "Tööriistad",
		"motivation": "balenaEtcher on tööriist, mis võimaldab kiiresti kloonida kettaid või kirjutada USB-pulkasid.",
		"logoImage": "/assets/images/projects/balena.png"
	},
	{
		"id": 6,
		"title": "snifr",
		"description": "macOS rakendus, mis leiab USB-ga ühendatud seadmeid ja kuvab nende seerianumbrid. See aitab tehnikutel tuvastada seadmeid ja nende seerianumbreid, et lihtsustada seadmete hooldust ja remonti. See kaotab vajaduse kivid maha joota seerianumbrite leidmiseks.",
		"technologies": ["Swift", "SwiftUI"],
		"link": "https://github.com/sookask/snifr",
		"type": "äpp",
		"year": "Kodukootud",
		"motivation": "macOS-i rakendus, mis tuvastab USB-ga ühendatud seadmed ja kuvab nende seerianumbrid, et aidata tehnikuid seadmete identifitseerimisel.",
		"logoImage": "/assets/images/projects/snifr.png"
	}
]